app/Controllers/Akun.php

    public function index()
    {
        $akunModel = new M_akun();
        $data['akun'] = $akunModel->findAll();
---
SELECT *
FROM `Akun`