app/Controllers/Pesanan.php

SELECT *
FROM `pesanan`
---
    public function index()
    {

        // Data untuk dikirim ke view
        $data = [
            'title' => 'Data Pesanan',
            'pesanan' => $this->pesanModel->findAll(),

SELECT *
FROM `pesanan`
---
    public function formTambah()
    {

        // Data untuk dikirim ke view
        $data = [
            'title' => 'Tambah Pesanan',
            'pesanan' => $this->pesanModel->findAll(),