app/Controllers/Produk.php

    public function lihatproduk()
    {

        // Data untuk dikirim ke view
        $data = [
            'title' => 'Data Produk',
            'produk' => $this->produkModel->findAll(),
---
SELECT *
FROM `produk`