app/Controllers/Profil.php

SELECT *
FROM `profile`
---
    public function index()
    {
        // Data untuk dikirim ke view
        $data = [
            'title' => 'Data Profil',
            'profile' => $this->model->findAll(),
        ];