app/Controllers/Testimoni.php

SELECT *
FROM `testimoni`
---
    public function testimoni()
    {
        $model = new M_testimoni();
        $data['testimoni'] = $model->findAll();