app/Controllers/Testimoni.php

    public function index()
    {
        $data = [
            'title' => 'Data Testimoni',
            'testimoni' => $this->model->select('testimoni.*, pengguna.nama as nama_pengguna')
                                       ->join('pengguna', 'pengguna.id_pengguna = testimoni.id_pengguna')
                                       ->findAll()
---
SELECT `testimoni`.*, `pengguna`.`nama` as `nama_pengguna`
FROM `testimoni`
JOIN `pengguna` ON `pengguna`.`id_pengguna` = `testimoni`.`id_pengguna`