app/Models/Pesanmodel.php

    public function getProdukList()
    {
        return $this->db->table('produk')->select('id_produk, produk')->get()->getResultArray();
---
SELECT `id_produk`, `produk`
FROM `produk`

    public function getPenggunaList()
    {
        return $this->db->table('pengguna')->select('id_pengguna, nama')->get()->getResultArray();
---
SELECT `id_pengguna`, `nama`
FROM `pengguna`