app/Models/ProdukModel.php

INSERT INTO `produk` (`produk`, `harga`, `warna`, `ukuran`, `gambar`, `stok`) VALUES ('dasdasdasdas', '90000', 'KUNING', 'L', '1718017699_bf9f459a3a85f60c334c.jpg', '11')
---
    public function tambahProduk($data)
    {
        $this->insert($data);